<template>
  <div class="privacy-policy">
    <h1>Політика конфіденційності</h1>

    <h2>1. Загальні положення</h2>
    <p>
      1.1. Компанія зобов'язується забезпечити захист вашої конфіденційності. У
      разі надання будь-якої особистої інформації, ви можете бути впевнені, що
      вона буде використовуватися відповідно до цієї Політики конфіденційності.
    </p>
    <p>
      1.2. Використовуючи наш сайт, ви погоджуєтеся з умовами обробки ваших
      персональних даних відповідно до цієї Політики.
    </p>

    <h2>2. Які дані ми збираємо</h2>
    <p>2.1. Ми можемо збирати наступні дані:</p>
    <ul>
      <li>Ім'я та прізвище</li>
      <li>
        Контактну інформацію, включаючи електронну адресу та номер телефону
      </li>
      <li>Адресу доставки (у разі оформлення замовлень)</li>
      <li>IP-адресу, тип браузера та операційної системи</li>
      <li>Інформацію про замовлення, історію покупок</li>
    </ul>

    <h2>3. Як ми використовуємо зібрані дані</h2>
    <p>3.1. Зібрані дані використовуються для:</p>
    <ul>
      <li>Оформлення та обробки ваших замовлень</li>
      <li>Поліпшення нашого сервісу та продуктів</li>
      <li>
        Надання інформації про акції, спеціальні пропозиції та нові товари (за
        вашою згодою)
      </li>
      <li>Для внутрішнього аналізу та статистики</li>
    </ul>

    <h2>4. Захист даних</h2>
    <p>
      4.1. Ми забезпечуємо технічні та організаційні заходи для захисту ваших
      персональних даних від незаконного доступу, втрати чи розкриття.
    </p>

    <h2>5. Передача даних третім особам</h2>
    <p>
      5.1. Ми не передаємо вашу особисту інформацію третім особам, за винятком:
    </p>
    <ul>
      <li>Компаній, які здійснюють доставку товарів</li>
      <li>Випадків, передбачених законодавством України</li>
      <li>
        Обслуговування платіжних систем для оплати товарів (якщо це необхідно)
      </li>
    </ul>

    <h2>6. Використання файлів "cookie"</h2>
    <p>
      6.1. Ми використовуємо файли cookie для покращення роботи нашого вебсайту.
      Це допомагає нам аналізувати трафік на сайті та пропонувати більш
      персоналізовані пропозиції.
    </p>

    <h2>7. Права користувачів</h2>
    <p>7.1. Ви маєте право:</p>
    <ul>
      <li>Доступу до своїх персональних даних</li>
      <li>Запитувати оновлення, виправлення або видалення ваших даних</li>
      <li>Відкликати згоду на обробку даних у будь-який момент</li>
    </ul>

    <h2>8. Зміни до Політики конфіденційності</h2>
    <p>
      8.1. Компанія залишає за собою право змінювати цю Політику
      конфіденційності в будь-який час. Будь-які зміни будуть опубліковані на
      цій сторінці.
    </p>

    <h2>9. Контактна інформація</h2>
  </div>
</template>

<script setup></script>

<style scoped>
.privacy-policy {
  padding: 150px 20px;
  font-family: Arial, sans-serif;
  line-height: 1.6;
}

.privacy-policy h1,
.privacy-policy h2 {
  color: #333;
}

.privacy-policy p {
  margin: 10px 0;
}

.privacy-policy ul {
  list-style-type: disc;
  padding-left: 20px;
}

.privacy-policy a {
  color: #007bff;
  text-decoration: none;
}

.privacy-policy a:hover {
  text-decoration: underline;
}
</style>
